In [6]:
from pandas import Series
se = Series([1,2,3,4,5])

In [7]:
se

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
se2 = Series([100,200,300], index=["a","b","c"])

In [10]:
se2

a    100
b    200
c    300
dtype: int64

In [12]:
se2["b"]

200

Series

In [13]:
salary = {"John":3000, "Rafi":2000, "Ashik":5000}

In [14]:
salary

{'John': 3000, 'Rafi': 2000, 'Ashik': 5000}

In [15]:
se3 = Series(salary)

In [16]:
salary

{'John': 3000, 'Rafi': 2000, 'Ashik': 5000}

In [17]:
se3

John     3000
Rafi     2000
Ashik    5000
dtype: int64

In [19]:
se3["Ashik"]

5000

# Data Frame

In [25]:
data ={ "Name":["Rafi","Ashik","Showrav"],
      "Age":[21,22,23],
      "Salary":[20000,21000,22000]
      }

In [26]:
from pandas import DataFrame
frame = DataFrame(data)

In [27]:
frame

      Name  Age  Salary
0     Rafi   21   20000
1    Ashik   22   21000
2  Showrav   23   22000

In [28]:
newFrame= DataFrame(data,columns=["Salary","Age","Name"])

In [29]:
newFrame

   Salary  Age     Name
0   20000   21     Rafi
1   21000   22    Ashik
2   22000   23  Showrav

In [30]:
Frame= DataFrame(data,columns=["Salary","Age","Name","Profile"])

In [31]:
Frame

   Salary  Age     Name Profile
0   20000   21     Rafi     NaN
1   21000   22    Ashik     NaN
2   22000   23  Showrav     NaN

In [34]:
newFrame["Salary"]

0    20000
1    21000
2    22000
Name: Salary, dtype: int64

In [36]:
newFrame.iloc[2]

Salary      22000
Age            23
Name      Showrav
Name: 2, dtype: object

In [37]:
Frame["Profile"]="Doctor"

In [38]:
Frame

   Salary  Age     Name Profile
0   20000   21     Rafi  Doctor
1   21000   22    Ashik  Doctor
2   22000   23  Showrav  Doctor

In [39]:
Frame["Education"]="BSc"

In [40]:
Frame

   Salary  Age     Name Profile Education
0   20000   21     Rafi  Doctor       BSc
1   21000   22    Ashik  Doctor       BSc
2   22000   23  Showrav  Doctor       BSc

# Transpose

In [41]:
Frame = Frame.T

In [42]:
Frame

                0       1        2
Salary      20000   21000    22000
Age            21      22       23
Name         Rafi   Ashik  Showrav
Profile    Doctor  Doctor   Doctor
Education     BSc     BSc      BSc

In [43]:
Frame = Frame.T

In [44]:
Frame

  Salary Age     Name Profile Education
0  20000  21     Rafi  Doctor       BSc
1  21000  22    Ashik  Doctor       BSc
2  22000  23  Showrav  Doctor       BSc

In [45]:
newFrame= DataFrame(data,columns=["Name","Age","Education","Profile","Salary"])

In [46]:
newFrame

      Name  Age Education Profile  Salary
0     Rafi   21       NaN     NaN   20000
1    Ashik   22       NaN     NaN   21000
2  Showrav   23       NaN     NaN   22000

In [47]:
Frame["Education"]="BSc"
Frame["Profile"]="Engineer"

In [48]:
Frame

  Salary Age     Name   Profile Education
0  20000  21     Rafi  Engineer       BSc
1  21000  22    Ashik  Engineer       BSc
2  22000  23  Showrav  Engineer       BSc

In [49]:
newFrame

      Name  Age Education Profile  Salary
0     Rafi   21       NaN     NaN   20000
1    Ashik   22       NaN     NaN   21000
2  Showrav   23       NaN     NaN   22000

In [50]:
newFrame["Education"]="BSc"
newFrame["Profile"]="Engineer"

In [51]:
newFrame

      Name  Age Education   Profile  Salary
0     Rafi   21       BSc  Engineer   20000
1    Ashik   22       BSc  Engineer   21000
2  Showrav   23       BSc  Engineer   22000

In [53]:
from pandas import Series
obj = Series([100,200,300,400,500], index=["d","a","b","a","e"])

In [54]:
obj

d    100
a    200
b    300
a    400
e    500
dtype: int64

obj = obj.reindex(['a','b','c','d','e'])

In [56]:
data

{'Name': ['Rafi', 'Ashik', 'Showrav'],
 'Age': [21, 22, 23],
 'Salary': [20000, 21000, 22000]}

In [57]:
frame

      Name  Age  Salary
0     Rafi   21   20000
1    Ashik   22   21000
2  Showrav   23   22000

In [58]:
frame = frame.reindex([1,0,2])
frame

      Name  Age  Salary
1    Ashik   22   21000
0     Rafi   21   20000
2  Showrav   23   22000

In [62]:
field=["Name","Salary","Age"]
frame=frame.reindex(columns=field)
frame

      Name  Salary  Age
1    Ashik   21000   22
0     Rafi   20000   21
2  Showrav   22000   23

In [ ]:
Delete

In [63]:
frame

      Name  Salary  Age
1    Ashik   21000   22
0     Rafi   20000   21
2  Showrav   22000   23

In [64]:
frame2 = frame.drop([2])

In [65]:
frame2

    Name  Salary  Age
1  Ashik   21000   22
0   Rafi   20000   21

In [68]:
frame3=frame.drop("Age", axis=1)

In [69]:
frame3

      Name  Salary
1    Ashik   21000
0     Rafi   20000
2  Showrav   22000

Arithmetic Operation

In [2]:
from pandas import Series
series1=Series([1,2,3,4,5])
series2=Series([100,200,300,400,500,600])

In [73]:
series1+series2

0    101.0
1    202.0
2    303.0
3    404.0
4    505.0
5      NaN
dtype: float64

In [74]:
from pandas import DataFrame
data1={"Speed":[100,103,105],
       "Temp": [34,23,42]
    
}

In [75]:
frame1=DataFrame(data1)

In [76]:
frame1

   Speed  Temp
0    100    34
1    103    23
2    105    42

In [80]:
data2={"Speed":[101,106,109],
       "Temp": [34,23,42],
       "Humidity":[42,23,15]
    
}
frame2=DataFrame(data2)
frame2

   Speed  Temp  Humidity
0    101    34        42
1    106    23        23
2    109    42        15

In [81]:
frame1+frame2

   Humidity  Speed  Temp
0       NaN    201    68
1       NaN    209    46
2       NaN    214    84

In [3]:
series2

0    100
1    200
2    300
3    400
4    500
5    600
dtype: int64

In [5]:
import pandas
data_frame = pandas.read_csv("name.csv")
data_frame

   Name   Course Semester Form Number Contact Number        Email ID Address
0  Rafi  CSE 510      5/1     1103072    01750676137  rafi@gmail.com  sylhet
1     d       dd        d           d              d               d       d
2     a        s        s           s              s               s       s

In [6]:
import pandas
data_frame = pandas.read_excel("form.xlsx")
data_frame

   Name   Course Semester Form Number Contact Number        Email ID Address
0  Rafi  CSE 510      5/1     1103072    01750676137  rafi@gmail.com  sylhet
1     d       dd        d           d              d               d       d
2     a        s        s           s              s               s       s

In [7]:
from pandas import DataFrame
data_frame=DataFrame(data_frame, columns=["Name","Semester","Address"])

In [8]:
data_frame

   Name Semester Address
0  Rafi      5/1  sylhet
1     d        d       d
2     a        s       s

In [11]:
import numpy as np
x = np.linespace(10,20,5, endpoint=False)
print(x)

AttributeError: module 'numpy' has no attribute 'linespace'